test/jmeter/jmeter.log
2025-12-03 10:18:20,117 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-12-03 10:18:20,128 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2025-12-03 10:18:20,128 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: Version 5.6.3
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: java.version=21.0.9
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: os.name=Mac OS X
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: os.arch=aarch64
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: os.version=26.1
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-03 10:18:20,130 INFO o.a.j.JMeter: Max memory     =1073741824
2025-12-03 10:18:20,131 INFO o.a.j.JMeter: Available Processors =8
2025-12-03 10:18:20,135 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-03 10:18:20,135 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-12-03 10:18:20,135 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2025-12-03 10:18:20,135 INFO o.a.j.JMeter: user.dir  =/Users/wan/Cursor/testrail-integration/test/jmeter
2025-12-03 10:18:20,135 INFO o.a.j.JMeter: PWD       =/Users/wan/Cursor/testrail-integration/test/jmeter
2025-12-03 10:18:20,144 INFO o.a.j.JMeter: IP: 192.168.10.63 Name: luffy.lan FullName: luffy.lan
2025-12-03 10:18:20,151 INFO o.a.j.s.FileServer: Default base='/Users/wan/Cursor/testrail-integration/test/jmeter'
2025-12-03 10:18:20,151 INFO o.a.j.s.FileServer: Set new base='/Users/wan/Cursor/testrail-integration/test/jmeter'
2025-12-03 10:18:20,234 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-03 10:18:20,254 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-03 10:18:20,255 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-03 10:18:20,256 INFO o.a.j.s.SaveService: Loading file: test.jmx
2025-12-03 10:18:20,285 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-03 10:18:20,285 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-03 10:18:20,285 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-03 10:18:20,285 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-03 10:18:20,285 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-03 10:18:20,285 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-03 10:18:20,296 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-03 10:18:20,301 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-03 10:18:20,302 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-03 10:18:20,302 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-03 10:18:20,303 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-03 10:18:20,304 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-03 10:18:20,331 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.11.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-03 10:18:20,367 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-junit-reporter-1.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-03 10:18:20,389 INFO o.a.j.JMeter: Running test (1764728300389)
2025-12-03 10:18:20,397 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2025-12-03 10:18:20,397 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2025-12-03 10:18:20,397 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-03 10:18:20,397 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2025-12-03 10:18:20,399 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-12-03 10:18:20,399 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-12-03 10:18:20,400 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2025-12-03 10:18:20,406 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = luffy.lan
2025-12-03 10:18:20,408 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-03 10:18:20,409 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-03 10:18:20,409 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-12-03 10:18:20,409 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-03 10:18:20,409 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-03 10:18:21,916 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2025-12-03 10:18:21,917 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2025-12-03 10:18:21,921 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-12-03 10:18:21,925 INFO n.c.b.j.ReportBuilder: "Average less than 100ms" MEAN(.*) < 1000 = FAILURE
2025-12-03 10:18:21,926 INFO n.c.b.j.ReportBuilder: "Not more than 1% sample error" ERRORS(.*) <= .01 = SUCCESS
2025-12-03 10:18:22,064 INFO n.c.b.j.ReportBuilder: Writing JUnit XML file reports/junit-results.xml
2025-12-03 10:18:22,086 INFO o.a.j.r.Summariser: summary =      1 in 00:00:02 =    0.6/s Avg:  1475 Min:  1475 Max:  1475 Err:     0 (0.00%)