test/jmeter/jmeter.log
2025-12-02 18:42:42,313 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-12-02 18:42:42,323 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2025-12-02 18:42:42,323 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2025-12-02 18:42:42,325 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-12-02 18:42:42,325 INFO o.a.j.JMeter: Version 5.6.3
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: java.version=21.0.9
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: os.name=Mac OS X
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: os.arch=aarch64
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: os.version=26.1
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: Max memory     =1073741824
2025-12-02 18:42:42,326 INFO o.a.j.JMeter: Available Processors =8
2025-12-02 18:42:42,330 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-02 18:42:42,330 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-12-02 18:42:42,330 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2025-12-02 18:42:42,330 INFO o.a.j.JMeter: user.dir  =/Users/wan/Cursor/testrail-integration/test/jmeter
2025-12-02 18:42:42,330 INFO o.a.j.JMeter: PWD       =/Users/wan/Cursor/testrail-integration/test/jmeter
2025-12-02 18:42:42,338 INFO o.a.j.JMeter: IP: 192.168.10.63 Name: luffy.lan FullName: luffy.lan
2025-12-02 18:42:42,344 INFO o.a.j.s.FileServer: Default base='/Users/wan/Cursor/testrail-integration/test/jmeter'
2025-12-02 18:42:42,345 INFO o.a.j.s.FileServer: Set new base='/Users/wan/Cursor/testrail-integration/test/jmeter'
2025-12-02 18:42:42,428 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-02 18:42:42,448 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-02 18:42:42,449 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-02 18:42:42,450 INFO o.a.j.s.SaveService: Loading file: test.jmx
2025-12-02 18:42:42,479 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-02 18:42:42,479 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-02 18:42:42,479 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-02 18:42:42,479 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-02 18:42:42,479 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-02 18:42:42,479 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-02 18:42:42,489 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-02 18:42:42,494 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-02 18:42:42,494 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-02 18:42:42,494 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-02 18:42:42,496 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-02 18:42:42,496 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-02 18:42:42,525 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.11.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-02 18:42:42,560 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-junit-reporter-1.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-02 18:42:42,584 INFO o.a.j.JMeter: Running test (1764672162584)
2025-12-02 18:42:42,592 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2025-12-02 18:42:42,592 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2025-12-02 18:42:42,592 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-02 18:42:42,592 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2025-12-02 18:42:42,594 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-12-02 18:42:42,594 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-12-02 18:42:42,594 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2025-12-02 18:42:42,601 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = luffy.lan
2025-12-02 18:42:42,603 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-02 18:42:42,604 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-02 18:42:42,604 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-12-02 18:42:42,604 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-02 18:42:42,604 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-02 18:42:43,902 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2025-12-02 18:42:43,902 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2025-12-02 18:42:43,906 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-12-02 18:42:43,910 INFO n.c.b.j.ReportBuilder: "Average less than 100ms" MEAN(.*) < 1000 = FAILURE
2025-12-02 18:42:43,911 INFO n.c.b.j.ReportBuilder: "Not more than 1% sample error" ERRORS(.*) <= .01 = SUCCESS
2025-12-02 18:42:44,062 INFO n.c.b.j.ReportBuilder: Writing JUnit XML file C:/Program Files/apache-jmeter-5.6.3/bin/samples/sample_results.xml
2025-12-02 18:42:44,062 ERROR n.c.b.j.ReportBuilder: Failed to write output file
java.io.FileNotFoundException: C:/Program Files/apache-jmeter-5.6.3/bin/samples/sample_results.xml (No such file or directory)
	at java.base/java.io.FileOutputStream.open0(Native Method) ~[?:?]
	at java.base/java.io.FileOutputStream.open(FileOutputStream.java:289) ~[?:?]
	at java.base/java.io.FileOutputStream.<init>(FileOutputStream.java:230) ~[?:?]
	at java.base/java.io.FileOutputStream.<init>(FileOutputStream.java:118) ~[?:?]
	at nz.co.breakpoint.jmeter.ReportBuilder.writeReportFile(ReportBuilder.java:98) ~[jmeter-junit-reporter-1.1.jar:?]
	at nz.co.breakpoint.jmeter.JUnitReporter.testEnded(JUnitReporter.java:78) ~[jmeter-junit-reporter-1.1.jar:?]
	at nz.co.breakpoint.jmeter.JUnitReporter.testEnded(JUnitReporter.java:72) ~[jmeter-junit-reporter-1.1.jar:?]
	at org.apache.jmeter.engine.StandardJMeterEngine.notifyTestListenersOfEnd(StandardJMeterEngine.java:266) ~[ApacheJMeter_core.jar:5.6.3]
	at org.apache.jmeter.engine.StandardJMeterEngine.run(StandardJMeterEngine.java:543) ~[ApacheJMeter_core.jar:5.6.3]
	at java.base/java.util.concurrent.Executors$RunnableAdapter.call(Executors.java:572) ~[?:?]
	at java.base/java.util.concurrent.FutureTask.run(FutureTask.java:317) ~[?:?]
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144) ~[?:?]
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642) ~[?:?]
	at java.base/java.lang.Thread.run(Thread.java:1583) [?:?]
2025-12-02 18:42:44,066 INFO o.a.j.r.Summariser: summary =      1 in 00:00:01 =    0.7/s Avg:  1267 Min:  1267 Max:  1267 Err:     0 (0.00%)